In [120]:
import pandas as pd

In [121]:
filepath = "https://bit.ly/world-cities-clean"

In [122]:
df= pd.read_csv(filepath)
df.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

In [123]:
fp = 'https://bit.ly/world-cities-dirty-v1'
print(fp)

https://bit.ly/world-cities-dirty-v1

In [124]:
df = pd.read_csv(fp , names = ["name","country","subcountry","geonameid"])
df.head(3)

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594

In [125]:
fp = 'https://bit.ly/world-cities-dirty-v2'
print(fp)

https://bit.ly/world-cities-dirty-v2

In [126]:
df = pd.read_csv(fp ,
skiprows = 2,
skipfooter = 1)
df.head()

/var/folders/sv/nvyrkmfj1bjb805g76mpfkyw0000gp/T/ipykernel_11296/937061303.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  df = pd.read_csv(fp ,

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

In [127]:
fp = 'https://bit.ly/world-cities-dirty-v3'
print(fp)

https://bit.ly/world-cities-dirty-v3

In [128]:
df = pd.read_csv(fp ,sep="|")
df.head()

       les Escaldes               Andorra Escaldes-Engordany  3040051
0  Andorra la Vella               Andorra   Andorra la Vella  3041563
1    Umm al Qaywayn  United Arab Emirates     Umm al Qaywayn   290594
2    Ras al-Khaimah  United Arab Emirates    Raʼs al Khaymah   291074
3      Khawr Fakkān  United Arab Emirates       Ash Shāriqah   291696
4             Dubai  United Arab Emirates              Dubai   292223

In [129]:
fp = "https://bit.ly/bitcoin-data"
print(fp)

https://bit.ly/bitcoin-data

In [130]:
df = pd.read_csv(fp,skipfooter=2)
df.head()

/var/folders/sv/nvyrkmfj1bjb805g76mpfkyw0000gp/T/ipykernel_11296/3009901075.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  df = pd.read_csv(fp,skipfooter=2)

          Date    Open*     High      Low  Close**       Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [131]:
df.isna().sum()

Date          0
Open*         0
High          0
Low           0
Close**       0
Volume        0
Market Cap    0
dtype: int64

In [132]:
df = df.rename(columns = {"Open*":"Open","Close**":"Close"})
df.head()

          Date     Open     High      Low    Close       Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [133]:
fp = "https://bit.ly/bitcoin-data"
print(fp)
df = pd.read_csv(fp)
df.head(2)

https://bit.ly/bitcoin-data

          Date    Open*     High      Low  Close**        Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  4.484178e+10  1.603195e+11
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  2.248291e+10  1.478905e+11

In [134]:
def sans_Espace(s):
    if " " in s:
        return s.replace(' ','_')
    elif "*" in s:
        return s.replace("*",'')
    else:
        return s

In [135]:
df2 = df.rename(sans_Espace , axis = "columns")
df2.head(3)

          Date     Open     High      Low    Close        Volume    Market_Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  4.484178e+10  1.603195e+11
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  2.248291e+10  1.478905e+11
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  2.290344e+10  1.487530e+11

In [136]:
fp = 'https://bit.ly/bitcoin-purchases'
print(fp)

https://bit.ly/bitcoin-purchases

In [137]:
df = pd.read_csv(fp)
df

                        bitcoin address wire amount          credit card
0    1HeUNvQfhjn8afvjMrMEX5VQB5zy8AacXZ    $2268.82  6759241310493014168
1    18xA8uEzQsEQpyfJWrrLmnu72ut7p2GgeU    $4590.27     6394078189900621
2    1CPLebXd6VKdEmD6xsVByYDbsyhkZ4XzrE    $6160.48     3539006321388994
3    1ESn9zPPwAExS98jqhjkDPd7tGeoevL42u    $6647.19     3560801557252993
4    1JLYsDExCUsEPrN6vNsEgJubJE4xqWtqhp    $3759.40     5349906235596126
..                                  ...         ...                  ...
995  138k9bHDuCABrp62m3jx7qN7GpLmH1tau1    $8777.99     6395533880416383
996  133bMbCx4XumvjzZCctexFdWFtc8AVe92T    $7614.59     5100136128250214
997  1EbNemXSs9jnJuTHg3JFs3sVsCpMVmkZzg    $1710.21  4911312234445162581
998  1ACsxcM3utWGaGtTKBndk7S68KX7bMQCaX    $5240.64  5038080137024268375
999  16PZEa57oL1MEMECPRYf8bwPAttqtuSaVj    $5672.95     4903401043022953

[1000 rows x 3 columns]

In [138]:
df.shape

(1000, 3)

In [142]:
df["wire amount"] = df["wire amount"].str.replace("$","").astype(float)

In [143]:
df.head(3)

                      bitcoin address  wire amount          credit card
0  1HeUNvQfhjn8afvjMrMEX5VQB5zy8AacXZ      2268.82  6759241310493014168
1  18xA8uEzQsEQpyfJWrrLmnu72ut7p2GgeU      4590.27     6394078189900621
2  1CPLebXd6VKdEmD6xsVByYDbsyhkZ4XzrE      6160.48     3539006321388994

In [144]:
df["wire amount"].mean()

5007.044379999999

In [145]:
df.dtypes

bitcoin address     object
wire amount        float64
credit card          int64
dtype: object

In [148]:
fp = 'https://bit.ly/bitcoin-purchases2'
print(fp)

https://bit.ly/bitcoin-purchases2

In [149]:
df = pd.read_csv(fp)
df

                        bitcoin address wire amount          credit card
0    1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92     3543456448666398
1    1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311,06     3584615208479876
2    1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032,44     6370577480710876
3    15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74     4508652385157398
4    18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44      374622922103592
..                                  ...         ...                  ...
995  1Jmz4FMQENDkrtkivVdXM8SiC6ZCJVTDhp     ¥844.68     5541649583285688
996  1GCZKgPV9277czn1RsTYoubCwhbndUvPZU    €1433,63  6304232254235660027
997   1LK2DsWBUmSAsqg7n46sdgg4v2SNrqEPM    €3814,11     3546750658508135
998  1PD6oNfFEnxMsR1PvUvkjHQdHYLCewLJhq    $2900.85  6333272716093574938
999  1B2vk6p7usuV4dfrBMLo8Rzpb5NatTmE8R    $1587.16     4913614335644981

[1000 rows x 3 columns]

In [156]:
df["wire amount"]=df["wire amount"].str.replace(r'[^\d.]', '', regex=True)

In [157]:
df.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe     8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q       31106  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP      203244  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6     8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ     3265.44   374622922103592

In [160]:
df.dtypes

bitcoin address     object
wire amount        float64
credit card          int64
dtype: object

In [159]:
df['wire amount'] = df['wire amount'].str.replace(',',".").astype("float")

In [161]:
fp = 'https://bit.ly/felonies-dataset'
print(fp)

https://bit.ly/felonies-dataset

In [162]:
df = pd.read_csv(fp)
df

          Date of Arrest  Age Convicted
0    2014-07-16 14:59:18   77       Yes
1    2002-12-19 22:17:59   28       Yes
2    1994-06-28 09:31:40   21        No
3    1985-05-14 09:52:17   45       Yes
4    1985-05-25 14:06:28   39       Yes
..                   ...  ...       ...
995  1992-02-04 14:24:25   72       Yes
996  1996-04-29 18:03:23   68       Yes
997  1980-07-15 21:59:27   87       Yes
998  1999-07-05 17:16:12   27        No
999  1996-03-17 18:29:25   57       Yes

[1000 rows x 3 columns]

In [163]:
df["Age_cat"] = pd.cut(df["Age"],
bins = [9,14,20,65,100],
labels = ['Enfant',"Ado","Adulte","Senior"])
df

          Date of Arrest  Age Convicted Age_cat
0    2014-07-16 14:59:18   77       Yes  Senior
1    2002-12-19 22:17:59   28       Yes  Adulte
2    1994-06-28 09:31:40   21        No  Adulte
3    1985-05-14 09:52:17   45       Yes  Adulte
4    1985-05-25 14:06:28   39       Yes  Adulte
..                   ...  ...       ...     ...
995  1992-02-04 14:24:25   72       Yes  Senior
996  1996-04-29 18:03:23   68       Yes  Senior
997  1980-07-15 21:59:27   87       Yes  Senior
998  1999-07-05 17:16:12   27        No  Adulte
999  1996-03-17 18:29:25   57       Yes  Adulte

[1000 rows x 4 columns]